#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-Ja1kGLgvveZHKFUh

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_base_path_mapping.shuuren_api_user_get_mapping: Refreshing state... [id=shuuren.com/]
aws_api_gateway_stage.shuuren_api_user_get_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/25f333c2-2da9-4cc8-8e9c-f91e53b41113]
aws_api_gateway_deployment.shuuren_api_user_get_deployment: Refreshing state... [id=gfzhmg]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=shuuren.com]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.shuuren_cert has been deleted
  - resource "aws_acm_certificate" "shuuren_cert" {
      - arn                       = "arn:aws:acm:us-east-1:265390238424:certificate/25f333c2-2da9-4cc8-8e9c-f91e53b41113" -> null
        id                        = "arn:aws:acm:us-east-1:265390238424:certificate/25f333c2-2da9-4cc8-8e9c-f91e53b41113"
        tags                      = {}
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.shuuren_cert_validation has been deleted
  - resource "aws_acm_certificate_validation" "shuuren_cert_validation" {
      - certificate_arn = "arn:aws:acm:us-east-1:265390238424:certificate/25f333c2-2da9-4cc8-8e9c-f91e53b41113" -> null
        id              = "0001-01-01 00:00:00 +0000 UTC"
    }

  # aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain has been deleted
  - resource "aws_api_gateway_domain_name" "shuuren_api_gateway_custom_domain" {
      - domain_name             = "shuuren.com" -> null
        id                      = "shuuren.com"
        tags                    = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.shuuren_cert will be created
  + resource "aws_acm_certificate" "shuuren_cert" {
      + arn                       = (known after apply)
      + domain_name               = "*.shuuren.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.shuuren.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.shuuren.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.shuuren_cert_validation will be created
  + resource "aws_acm_certificate_validation" "shuuren_cert_validation" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.shuuren_api_mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "shuuren_api_mapping" {
      + api_id      = "kvf6m5r20e"
      + domain_name = "api.shuuren.com"
      + id          = (known after apply)
      + stage_name  = "api"
    }

  # aws_api_gateway_deployment.shuuren_api_deployment will be created
  + resource "aws_api_gateway_deployment" "shuuren_api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "kvf6m5r20e"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_deployment.shuuren_api_user_get_deployment will be destroyed
  # (because aws_api_gateway_deployment.shuuren_api_user_get_deployment is not in configuration)
  - resource "aws_api_gateway_deployment" "shuuren_api_user_get_deployment" {
      - created_date  = "2022-10-05T00:31:50Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/" -> null
      - id            = "gfzhmg" -> null
      - invoke_url    = "https://kvf6m5r20e.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "kvf6m5r20e" -> null
      - triggers      = {
          - "redeployment" = "2843589bf8171cf3326b29cc0e4500fd277509b5"
        } -> null
    }

  # aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain will be created
  + resource "aws_api_gateway_domain_name" "shuuren_api_gateway_custom_domain" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.shuuren.com"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_api_gateway_integration.shuuren_api_user_get_integration must be replaced
+/- resource "aws_api_gateway_integration" "shuuren_api_user_get_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "pbfffe" -> (known after apply)
      ~ id                      = "agi-kvf6m5r20e-pbfffe-GET" -> (known after apply)
      - integration_http_method = "GET" -> null # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ type                    = "HTTP" -> "MOCK" # forces replacement
      - uri                     = "https://api.publicapis.org/entries" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api_policy.shuuren_api_policy will be created
  + resource "aws_api_gateway_rest_api_policy" "shuuren_api_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "execute-api:Invoke"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rest_api_id = "kvf6m5r20e"
    }

  # aws_api_gateway_stage.shuuren_api_stage will be created
  + resource "aws_api_gateway_stage" "shuuren_api_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "kvf6m5r20e"
      + stage_name    = "api"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_stage.shuuren_api_user_get_stage will be destroyed
  # (because aws_api_gateway_stage.shuuren_api_user_get_stage is not in configuration)
  - resource "aws_api_gateway_stage" "shuuren_api_user_get_stage" {
      - arn                   = "arn:aws:apigateway:us-east-1::/restapis/kvf6m5r20e/stages/api" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "ski1xl" -> null
      - execution_arn         = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/api" -> null
      - id                    = "ags-kvf6m5r20e-api" -> null
      - invoke_url            = "https://kvf6m5r20e.execute-api.us-east-1.amazonaws.com/api" -> null
      - rest_api_id           = "kvf6m5r20e" -> null
      - stage_name            = "api" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
    }

Plan: 8 to add, 0 to change, 3 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*